#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```
terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/org39/infra-do/runs/run-XbNLbUomgK16mMhM

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.digitalocean_vpc.this: Refreshing state... [id=567d0d16-4b11-4924-8c40-f48914ee2893]
module.dns.digitalocean_domain.this: Refreshing state... [id=org39.com]
digitalocean_project.org39: Refreshing state... [id=08a90aee-060d-4b7d-aedb-c7c5fceda11c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_project.org39 will be updated in-place
  ~ resource "digitalocean_project" "org39" {
        id          = "08a90aee-060d-4b7d-aedb-c7c5fceda11c"
        name        = "org39"
      ~ resources   = [
          - "do:domain:org39.com",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.kubernetes.digitalocean_kubernetes_cluster.this will be created
  + resource "digitalocean_kubernetes_cluster" "this" {
      + auto_upgrade   = false
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "k8s-01"
      + region         = "sgp1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = false
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.22.7-do.0"
      + vpc_uuid       = "567d0d16-4b11-4924-8c40-f48914ee2893"

      + maintenance_policy {
          + day        = (known after apply)
          + duration   = (known after apply)
          + start_time = (known after apply)
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + name              = "default"
          + node_count        = 1
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>
<!-- Sticky Pull Request Commentplan -->